factors_map = {'Холодная обработка':1,
               'жарка на сковороде с маслом':2,
               'тушение':3,
               'приготовление на пару':4,
               'варка':5,
               'варка запекание':6,
               'запекание':6,
               'жарка на сковороде без масла':7,
               'жарка на сковроде без масла':7,
               'медленная варка':8,
               'варка на медленном огне':8,
               'Бланширование':9,}
# Convert product names to ids
##############################################
import pandas as pd

# Load the Excel file
file_path = 'micros_losses.xlsx'  # Replace with the path to your Excel file
df = pd.read_excel(file_path)

# Assuming 'product_id_map' is your mapping dictionary
# Example: product_id_map = {'ProductA': 'ID1', 'ProductB': 'ID2', ...}

# Replace values in the first column based on the mapping
first_column_name = df.columns[1]
df[first_column_name] = df[first_column_name].apply(lambda x: factors_map.get(x, x))


# Example mapping dictionary
# Replace this with your actual mapping
header_id_mapping = {
    "TFA, трансжирные кислоты":1,
        "Аланин":2,
        "Аргинин":3,
        "Аспарагиновая кислота":4,
        "Валин":5,
        "ТиаминB1":6,
        "Витамин В 12":7,
        "Ниацин":8,
        "Витамин B5 пантотеновая кислота":9,
        "Витамин B7, биотин (витамин H)":10,
        "Фолиевая кислота":11,
        "Рибофлавин":12,
        "Витамин С, аскорбиновая кислота":13,
        "Вода":14,
        "Водорастворимая клетчатка":15,
        "Гистидин":16,
        "Глицин":17,
        "Глутаминовая кислота":18,
        "Докозагексаеновая кислота":19,
        "Железо, Fe":20,
        "Изолейцин":21,
        "Йодид":22,
        "Калий, К":23,
        "Кальций, Са":24,
        "Кальциферолы витамина D":25,
        "Бета-криптоксантин":26,
        "Лейцин":27,
        "Лизин":28,
        "Ликопин":29,
        "Лютеин + зеаксантин":30,
        "Магний,Mg":31,
        "Марганец":32,
        "Медь, Cu":33,
        "Метионин":34,
        "Мононенасыщенные жирные кислоты":35,
        "Натрий, Na":36,
        "Незаменимые аминокислоты":37,
        "Нерастворимая в воде клетчатка":38,
        "Октадекатриеновая кислота / линоле новая кислота":39,
        "Омега-3 жирные кислоты":40,
        "Омега-6 жирные кислоты":41,
        "Органические кислоты":42,
        "Витамин В 6":43,
        "Пищевые волокна":44,
        "Поваренная соль всего":45,
        "Полиненасыщенные жирные кислоты":46,
        "Пролин":47,
        "Сахароза (свекольный сахар)":48,
        "Селен":49,
        "Серин":50,
        "Соотношение полиненасыщенных и насыщенных жиров (P / S)":51,
        "Средний размер порции":52,
        "Тирозин":53,
        "Треонин":54,
        "Триптофан":55,
        "Фенилаланин":56,
        "Филлохинон витамина К":57,
        "Фосфор, Р":58,
        "Хлебные единицы":59,
        "Хлорид":60,
        "Холестерин":61,
        "Цинк, Zn":62,
        "Цистеин":63,
        "Эйкозапентаеновая кислота":64,
        "Эквивалент альфа-токоферола витамина Е":65,
        "Витамин А, IU":66,
}


# Replace DataFrame headers with IDs from the mapping if they are in the mapping
df.columns = [header_id_mapping.get(col, col) for col in df.columns]

# Save the modified DataFrame to a new Excel file
new_file_path = 'micros_losses_with_ids.xlsx'
df.to_excel(new_file_path, index=False)


