products = """Сливочный сыр не менее  50% жирности   
Сливочный сыр  не менее  45% жирности   
Хрустящий хлебец из смешанной пшеничной муки
Хрустящий хлебец из смешанной ржаной муки 
Хрустящий хлебец из ржаной пшеничной муки с кунжутом
Хрустящий хлебец из смешанной пшеничной муки с кунжутом
Хрустящий хлебец из смешанной ржаной муки со злаками
Хрустящий хлебец из смешанной пшеничной муки со злаками
Хрустящий хлебец из смешанной ржаной муки с семенами льна
Хрустящий хлебец из смешанной пшеничной муки с семенами льна
Абрикос сушеный (курага)
Абрикос целый
Абрикосовый / апельсиновый сок
Абрикосовый джем
Абрикосовый сок
Авокадо сырое целое
Айва сырая целая
Ананас замороженный 
Ананас консервированный без жидкости
Ананас сырой целый
Ананасовый сок
Апельсин сырой целый
Апельсиновый сок
Арахис сырой цельный
Арбуз сырой целиком
Базилик сушеный
Базилик сырой
Баклажаны сырые целые
Банан сырой целый
Баранина нежирная сырая
Баранина средней жирности сырая
Батончик мюсли
Мука гречневая без глютена 
Мучная смесь без глютена  для хлеба 
Белый рис сырой
Белый пшеничный хлеб
Белый пшеничный хлеб из муки грубого помола
Белый пшеничный хлеб с отрубями
Белый хлеб без глютена
Фасоль огненно-красная консервированная ,без жидкости
Фасоль огненно-красная консервированная с жидкостью
Фасоль огненно-красная сырая
Соевые бобы консервированные с жидкостью
Брокколи глубокой заморозки
Брокколи сырая целая
Брюссельская капуста глубокой заморозки
Брюссельская капуста сырая 
Булгур
Булочка из гречневой муки
Булочка из кукурузной муки
Булочка из муки грубого помола
Булочка из пшеницы грубого помола на дрожжах
Булочка из пшенной муки
Булочка из рисовой муки
Булочка из слоеного теста
Булочка из смешанной цельнозерновой ржаной муки 
Булочка из цельнозерновой /ржаной муки
Булочка из цельнозерновой муки
Булочка из цельнозерновой муки с изюмом
Булочка из цельнозерновой муки с кунжутом
Булочка из цельнозерновой муки с отрубями
Булочка из цельнозерновой ржаной муки 
Булочка из цельнозерновой ржаной муки  с изюмом
Булочка из цельнозерновой ржаной муки с кунжутом
Булочка из цельнозерновой ржаной муки с маком
Булочка изделие из мультизерновой муки
Булочка из овсяной муки
Бурые водоросли консервированные с жидкостью
Бурые водоросли сырые
Варенье из брусники
Варенье из вишни
Варенье из ежевики
Варенье из сливы
Варенье из черной смородины
Виноград белый сырой цельный
Виноград красный цельный
Виноградные листья  сырые
Вишня глубокой заморозки
Вишня сырая
Вишня сырая (черешня)
Говядина сырая
Горох зеленый сушеный 
Горох зеленый сырой
Горошек зеленый глубокой заморозки
Горошек зеленый консервированный ,без жидкости,
Горошек зеленый консервированный с жидкостью
Гранат сырой целый
Грейпфрут сырой целый
Грецкие орехи сырые целые
Грецкий орех сырой
Гречневая крупа
Гречневая мука
Гречневый хлеб
Грудка индейки глубокой заморозки
Грудка индейки сырая
Груша сушеная
Груша сырая целая
Густая сметана 20% жирности
Густая сметана 30% жирности
Джем из ежемалины
Дрожжевое тесто облегченное, сырое
Дрожжевое тесто средней жирности (приготовленное на воде)
Дрожжевое тесто средней жирности, сырое
Дрожжи
Желатин
Зернистый творог  <10% жирности   
Зернистый творог не менее  10% жирности   
Зернистый творог не менее  20% жирности   
Изюм
Изюм
Имбирный пряник
Имбирь сушеный
Индейка глубокой заморозки
Индейка сырая
Йогурт   (общее понятие ) 1,5% жирности
Йогурт   (общее понятие ) 3,5% жирности
Йогурт  3,5% жирности с пробиотиком
Йогурт 1,5% жирности
Йогурт 1,5% жирности без лактозы
Йогурт 1,5% жирности с мюсли
Йогурт 1,5% жирности с мюсли несладкий
Йогурт 1,5% жирности с пробиотиком
Йогурт 1,5% жирности с фруктами несладкий
Йогурт 3,5% жирности
Йогурт 3,5% жирности без лактозы
Йогурт 3,5% жирности с мюсли
Йогурт 3,5% жирности с мюсли несладкий
Йогурт 3,5% жирности с фруктами и мюсли
Йогурт 3,5% жирности с фруктами и мюсли несладкий
Йогурт 3,5% жирности с фруктами и пробиотиком несладкий
Йогурт 3,5% жирности с фруктами несладкий
Йогуртовый напиток 1,5% жирности несладкий
Йогуртовый напиток 1,5% жирности с фруктами
Йогуртовый напиток 3,5% жирности
Йогуртовый напиток 3,5% жирности несладкий
Йодированная соль
Кабачки сырые
Какао порошок
Камбала глубокой заморозки
Камбала нарезанная сырая
Капуста белокочанная сырая целая
Картофель  сырой целый
Квашеная капуста (6)
Кефир 1,5% жирности
Кефир 3,5% жирности
Киви сырые целые
Киноа сырая
Пекинская капуста сырая целая
Клубника глубокой заморозки
Клубника сырая целая
Клубничный джем
Клюква сушеная
Кобылье молоко 
Козье молоко
Кольраби глубокой заморозки
Кольраби сырая
Конина нежирная глубокой заморозки
Конина нежирная сырая
Корень имбиря
Краснокочанная капуста сырая целая
Крахмал
Крекеры
Крекеры легкие и хрустящие
Круассан из слоеного теста
Крупа перловая 
Кукуруза глубокой заморозки
Кукуруза сырая целая
Кукурузная крупа
Кукурузная мука
Кукурузное масло
Кукурузные лепешки из цельнозерновой муки
Кукурузные хлопья
Кукурузные шарики
Кукурузный крахмал
Кукурузный хлеб
Кукурузный хлеб из цельнозерновой муки
Кунжутное семя сырое
Куриная грудка  сырая
Куриная ножка глубокой заморозки
Куриная ножка сырая
Куриное мясо с кожей
Куриное мясо с кожей глубокой заморозки
Куриное мясо  сырое
Куриное яйцо, белок, сырое
Куриное яйцо, желток, сырое
Куриное яйцо, сырое, с скорлупой
Курица сырая
Кускус сырой
Лавровый лист сушеный
Лимон сырой целый
Лимонная кислота
Лимонный сок
Лист петрушки сырой целый
Лист сельдерея сырой
Листовая зелень сырая
Листовая капуста сырая
Листовой салат сырой целый
Шпинат сырой
Салат Лолло россо сырой
Лук зеленый сырой
Лук репчатый сырой целый
Льняное семя сырое
Макаронные изделия без глютена, сухие
Макаронные изделия без яиц из твердых сортов пшеницы, сухая
Сочни из  пшеничной муки
Макаронные изделия, без яиц, спагетти, сухие
Макаронные изделия с высоким содержанием яиц, сухие
Малина глубокой заморозки
Малина сырая целиком
Малиновое варенье
Малиновое желе
Мандарин сырой целиком
Мандариновое варенье
Манная крупа
Маргарин для выпечки
Масло сливочное
Маффины
Маффины с черникой
Мед
Дыня сырая целиком
Мелкоплодная клюква сырая
Микс фруктовое варенье
Минтай глубокой заморозки
Минтай сырой
Простокваша
Молоко коровье 1,5% жирности
Молоко коровье 1,5% жирности безлактозное ультрапастеризованное (УВТ)
Молоко коровье 1,5% жирности кипяченное
Молоко коровье 1,5% жирности ультрапастеризованное (УВТ)
Молоко коровье 3,5% жирности
Молоко коровье 3,5% жирности без лактозы 
Молоко коровье 3,5% жирности кипяченное
Молоко коровье свежее  3,5% жирности кипяченное
Молоко коровье ультрапастеризованное (УВТ) жирностью 3,5%
Молочные напитки 1,5% жирности с ультрапастеризацией (УВТ)
Молочные напитки 1,5% жирности с фруктами без сахара
Молочные напитки 3,5% жирности с несладкими фруктами
Молочные напитки с пробиотиками
Молочные напитки, жирность 3,5%, ультрапастеризованные
Морковный сок
Морковь сырая целая
Морская камбала глубокой заморозки
Морская соль
Моцарелла
Моцарелла 20% жирности  
Мука гречневая светлая
Мука грубого помола из нескольких злаков
Соевая мука
Цельнозерновая мука
Мука пшеничная (сорт 650-1800)
Мука пшеничная с разрыхлителем
Мука пшеничная сорт <650
Мука пшеничная сорт 1050
Мука пшеничная сорт 1200
Мука пшеничная сорт 1600
Мука пшеничная сорт 1700
Мука пшеничная сорт 405
Мука пшеничная сорт 550
Мука пшеничная сорт 630
Мука пшеничная сорт 812
Мюсли
Мюсли подслащенные
Мягкий сыр  не менее  20% жирности  
Мягкий сыр  не менее  30% жирности  
Мягкий сыр  не менее  40% жирности  
Мягкий сыр  не менее  45% жирности  
Мягкий сыр  не менее  50% жирности  
Мягкий сыр из козьего молока не менее  30% жирности   
Мягкий сыр из козьего молока не менее  40% жирности   
Мягкий сыр из козьего молока не менее  45% жирности   
Мягкий сыр из козьего молока не менее  50% жирности   
Мясо говядины сырое
Мясо индейки без кожи глубокой заморозки
Мясо индейки без кожи сырое
Напитки молочные 1,5% жирности несладкие
Напитки молочные 1,5% жирности с фруктовыми добавками
Напитки молочные 3,5% жирности с фруктовыми добавками
Напиток йогуртовый 1,5% жирности с фруктами несладкий
Нектарин сырой целый
Джем из нектарина
Ножка индейки сырая
Нут сушеный
Нут сырой
Ньокки (итальянские клецки) сырые
Овес цельнозерновой сырой
Овощная смесь  - горох и морковь -  cырая
Овсяная крупа
Овсяная мука
Овсяная мука грубого помола 
Овсяно-ореховое печенье
Овсяное печенье
Овсяное печенье
Овсяное печенье для диабетиков
Овсяные хлопья Геркулес
Овсяные хлопья из цельнозерновой муки
Огурец консервированный с жидкостью
Огурец консервированный без жидкости
Огурец маринованный с жидкостью
Огурец маринованный сушеный
Огурец сырой целый
Форель глубокой заморозки
Озерная форель сырая
Оливки зеленые маринованные ,без жидкости,
Оливки зеленые маринованные с жидкостью
Оливки черные маринованные ,без жидкости,
Оливки чёрные маринованные с жидкостью
Оливковое масло
Орегано (дикий майоран) сушеный
Орехи кешью сырые цельные
Панировочные сухари
Панировочные сухари без глютена
Панировочные сухари из белого хлеба
Паприка сладкая
Ленточная лапша, паста без яиц, сухая
Макароны без яиц, сухие
Паста без яиц, суповая лапша, сухая
Паста без яиц, сухая
Паста из свежих яиц, сухая
Паста яичная из цельнозерновой муки, сухая
Паста из цельнозерновой муки, без яиц, пшеничная, сухая
Паста из цельнозерновой муки, без яиц, сухая
Паста из цельнозерновой муки, сухая
Сладкий перец зеленый
Перловая крупа
Персик консервированный с жидкостью
Персик сырой целый
Персиковое варенье
Персиковый сок
Песочное печенье
Песочное сырное печенье
Печенье из бисквитного теста
Пищевые дрожжи
Плоды шиповника сушеные
Подсолнечное масло
Полутвердый сыр  не менее 40% жирности  
Полутвердый сыр  не менее 45% жирности  
Полутвердый сыр  не менее 50% жирности  
Полутвердый сыр из козьего молока не менее  45% жирности   
Полутвердый сыр из козьего молока не менее  50% жирности   
Природная минеральная вода
Природная минеральная вода негазированная
Природная минеральная вода с низким содержанием минералов
Природная минеральная негазированная вода с низким содержанием минералов
Просо сырое
Простокваша (густая) 1,5% жирности
Простокваша (густая) 1,5% жирности с фруктами
Простокваша (густая) 3,5% жирности
Простокваша (густая) 3,5% жирности с фруктами
Простокваша (густая) с мюсли
Простокваша (густая) с фруктами
Простокваша (жидкая)
Простокваша (жидкая) <1% жирности
Простокваша (жидкая) 1,5% жирности
Простокваша (жидкая) 3,5% жирности
Кефир 3,5% жирности
Пшеничная крупа
Пшеничная лепешка
Пшеничная мука
Пшеничная мука грубого помола
Пшеничная мука грубого помола сорт 1700
Пшеничная мука грубого помола сорт 1700 вареный
Пшеничная мука грубого помола сорт 1700 приготовленный
Пшеничные отруби
Пшеничные хлопья
Пшеничный крахмал
Пшеничный хлеб грубого помола на дрожжах
Пшено 
Разрыхлители
Рапсовое масло 
Редис красный сырой
Редька сырая целая
Ржаная мука
Ржаная мука (сорт <650)
Ржаная мука (сорты 650-1800)
Ржаная мука грубого помола
Ржаная мука приготовленная
Ржаная мука сорт 1150
Ржаная мука сорт 1370
Ржаная мука сорт 1590
Ржаная мука сорт 1740
Ржаная мука сорт 815
Ржаная мука сорт 997
Рис круглозерновой 
Рисовая лапша
Рисовая мука
Рисовый крахмал
Рисовый хлеб
Рыба сырая
Сазан глубокой заморозки
Сазан нарезанный сырой
Салат Айсберг сырой целый
Сафлоровое масло
Сахар белый
Сахар для диабетиков
Сахарная пудра 
Свекла сырая целая
Свекольный сок
Сгущенное молоко <1% жирности
Сгущенное молоко 10% жирности
Сгущенное молоко 10% жирности ультрапастеризованное (УВТ)
Сгущенное молоко с сахаром
Сгущенное молоко с сахаром <1% жирности
Сгущенное молоко с сахаром <10% жирности
Селедка (атлантическая) соленая
Сельдерей сырой целый
Семена мака сырые
Семена подсолнечника сырые
Сладкий перец зеленый сырой
Сладкий перец красный сырой
Сладкий перец сырой
Сладкий перец сырой целый
Слива круглая сырая
Слива синяя целая
Сливки 30% жирности
Сливки для кофе 10% жирности
Сливки для кофе 20% жирности
Сливки для кофе 30% жирности
Сливовое варенье
Сливовый джем
Сливочное масло 82,5% жирности
Сливочное масло высшего качества
Сливочное масло полужирное
Сливочное масло соленое
Сливочный сыр не менее 50% жирности   
Сливочный сыр не менее 60% жирности   
Сливочный сыр не менее  70% жирности   
Сливы сушеные (чернослив)
Сметана 10% жирности
Сметана 20% жирности
Сметана 30% жирности
Смородина сырая
Соевые бобы сырые
Соевый соус
Соевый соус белый
Стебель сельдерея сырой
Стручковая спаржевая фасоль сырая
Стручковая фасоль зеленая сырая
Судак глубокой заморозки
Судак филе сырой
Сухари
Сухари из цельнозерновой муки для диабетиков
Сухари, без глютена
Морская капуста сушеная
Морская капуста вареная
Сухие дрожжи
Сушеный чеснок
Сыр Гауда  не менее 40% жирности  
Сыр Гауда  не менее 45% жирности  
Сыр Камамбер не менее  40% жирности   
Сыр Камамбер не менее  45% жирности   
Сыр Пармезан  не менее 40% жирности  
Сыр Пармезан  не менее 45% жирности  
Сыр Эдам  не менее 40% жирности  
Сыр Эдам  не менее 45% жирности  
Сыр Эдам  не менее 50% жирности  
Сыр Эмменталь  не менее 40% жирности  
Сыр Эмменталь  не менее 50% жирности  
Сыр Эмменталь не менее 45% жирности  
Сырое дрожжевое тесто 
Творог <10% жирности   
Творог не менее  10% жирности   
Творог не менее  20% жирности   
Творог обезжиренный
Телятина нежирная сырая
Песочное тесто сырое
Томатная паста
Томатное пюре
Томатный сок
Помидоры сырые целые
Лаваш
Тыква сырая целая
Тыквенные семечки сушеные
Укроп сушеный
Укроп сырой
Уксус
Уксусная кислота
Фарш сырой
Фасоль белая сушеная
Фасоль зеленая глубокой заморозки
Фасоль кидни сушеная
Фета
Филе говядины глубокой заморозки
Филе говядины нежирное сырое
Филе говядины сырое
Филе куриной грудки глубокой заморозки
Филе куриной грудки сырое
Финик сушеный
Хек глубокой заморозки
Хек нарезанный сырой
Цельнозерновой хлеб
Цельнозерновой хлеб
Хлопья для завтрака
Хлопья зерновой смеси
Хрустящие мюсли, обогащенные 7 витаминами и кальцием
Хрустящие хлебцы без глютена
Хурма сырая целая
Цветная капуста сырая целая
Цельнозерновая мука
Цикорий кофейный порошок
Цуккини сырой целый
Чай фруктовый сухой
Черешня сырая целая
Черная смородина замороженная
Черная смородина сырая целая
Черника глубокой заморозки
Черника сырая целиком
Черничное варенье
Черный хлеб
Черный хлеб
Мультизерновой хлеб
Ржаной хлеб 
Ржано-пшеничный хлеб
Ржано-пшеничный хлеб
Черный чай сухой
Чеснок сырой целый
Чечевица спелая сушеная
Шпинат глубокой заморозки
Шпинат сырой целый
Щавель сырой
Яблоко очищенное сушеное
Яблоко сырое целое
Яблочный / морковный фруктовый сок
Яблочный сок
Яблочный сок (без добавления сахара)
Яблочный сок, обогащенный витамином С
Ячневая крупа
Фарш куриный
Фарш индейки
Семечки тыквенные несоленые
Семечки подсолнечника простые несоленые
Семена кунжута
Семя льняное
Бублик
Крекеры с сыром
Крекеры с сыром, цельнозерновый
Крекеры, хрустящие хлебцы
Крекеры, мультизерновые
Крекеры без глютена, простые
Йогурт по-гречески, без добавок
Йогурт обезжиренный, простой
"Молоко сгущенное с сахаром нежирное"
"Молоко «Славянское» сгущенное с сахаром нежирное"
"Молоко сгущенное стерилизованное нежирное"
Молоко сухое нежирное
Молоко пастеризованное,1,5°/о жирности
Молоко пастеризованное,2,5°/о жирности
Молоко стерилизованное,1,5°/о жирности
Молоко стерилизованное,2,5% жирности
Йогурт1,5°/о жирности
Йогурт плодово-ягодный,1,5% жирности
Кефир2,5°/о жирности
"Кумыс из кобыльего молока"
"Напиток кисломолочный,«Бифидин» 2,5°/о жирности"
Напиток «Снежок»2,5°/о жирности
Напиток«Юбилейный»,2,5°/о жирности
Продукт кисломолочный «Тонус»2,5°/о жирн
Простокваша«Цитрусовая»2,5°/о жирности
Ряженка2,5°/о жирности
Творог«Столовый»2,0°/о жирности
Молоко «Дружба»сгущенное с сахаром
Молоко пастеризованное3,2°/о жирности
Молоко стерилизованное3,2°/о жирности
Молоко пастеризованное 3,5% жирности
Молоко стерилизованное 3,5°/о жирности
Молоко топленое 4,0°/о жирности
Сливки пастеризованные 8,0°/о жирности
Сливки пастеризованные 10,0% жирности
Сливки стерилизованные10,0°/о жирности
Ацидофилин3,2% жирности
Ацидофилин сладкий 3,2°/о жирности
Йогурт 3,2°/о жирности
Йогурт сладкий 3,2°/о жирности
Йогурт6,0°/о жирности
Йогурт сладкий 6,0°/о жирности
Кефир 3,2% жирности
Простокваша 3,2°/о жирности
Простокваша оменниковская»4,0°/о жирности
Ряженка 4,0°/о жирности
Ряженка 6,0°/о жирности
Сметана 10,0°/о жирности
Сметана «Домашняя» 10,0°/о жирности
Творог мягкий диетический 4,0°/о жирности
"Творог мягкий диетический, плодово-ягодный, 4,0°/о жирности"
Сыр домашний 4,0°/о жирности
Паста ацидофильная 4,0°/о жирности
-Творог «Крестьянский» 5,0°/о жирности
Крем творожный с ванилином 5,0% жирности
Паста ацидофильная,сладкая 8,0% жирности
"Сырки и масса творожная«Цитрон» сладкие, 8,0°/о жирности"
Творог полужирный 9,0°/о жирности
Молоко сгущенное с сахаром,5,0°/о жирности
Молоко сгущенное с сахаром 8,5% жирности
"Молоко сгущенное стерилизованное 7,8% жирности"
Сливки пастеризованные 20,0°/о жирности
Сливки пастеризованные 35,0°/о жирности
Сливки стерилизованные25,0°/о жирности
Сметана15,0°/о жирности
Сметана 20,0°/о жирности
Сметана 25,0°/о жирности
Сметана 30,0% жирности
Творог мягкий диетический 11,0°/о жирности
Творог жирный 18,0°/о жирности
Сырки творожные детские,23,0°/о жирности
Сливки сгущенные с сахаром,19,0% жирности
Сливки сухие 42,0°/о жирности
Латвийский сыр
Костромской сыр
Пошехонский сыр
"Голландский (брусковый) сыр"
Российский сыр
"Голландский (круглый) сыр"
Швейцарский сыр
Литовский сыр 
Адыгейский сыр
Рокфор сыр
Русский камамбер сыр
Брынза (из коровьего молока) сыр
Сулуryни
Костромской сыр
Яйцо целое куриное
"Яйцо отварное по 1-310 куриное"
Говядина 1 кат.
Говядина 2 кат.
Конина 1 кат.
Конина 2 кат.
Телятина 1 кат.
Телятина 2 кат.
"Бройлеры (цыплята) 1 кат."
"Бройлеры (цыплята) 2 кат."
Индейки 1 кат.
Индейки 2 кат.
Куры 1 кат.
Куры 2 кат.
Мука 1 сорта
Макароны из муки 1 сорта
Мука высшего сорта
"Хлеб пшеничный формовой (Мука высшего сорта)"
Батон нарезной (Мука высшего сорта)
Рожки к чаю (Мука высшего сорта)
Баранки сдобные (Мука высшего сорта)
Сушки простые (Мука высшего сорта)
Сухари сливочные (Мука высшего сорта)
Печенье Крокет
Хлопья «Геркулес» (овес)
Крупа рисовая
Мука диетическая (гречиха)
Крупа продел (гречиха)
Крупа ядрица (гречиха)
Крупа перловая
Крупа ячневая
"Крупа пшено шлифованное"
Крупа (кукуруза)
Крахмал (кукуруза)
Мука (кукуруза)
Горох, зерно
Горох, лущеный
Горошек зеленый
"Горошек зеленый. Консервы"
Фасоль, зерно
Фасоль (стручок)
Чечевица, зерно
Абрисоковый сок
Апельсиновый сок
Виноградный сок
Вишневый сок
Гранатовый сок
Яблочный сок
Морковный сок
Томатный сок
Масло сладко сливочное несоленое
Масло сливочное несоленое «Крестьянское»
Масло кукурузное
Масло оливковое
Масло подсолнечное
Масло рапсовое
Казы
Шужук
Жент
Жент с изюмом
Чак-чак
Курт
Иримшик
Кукуруза консервированная ,без жидкости,
Скумбрия глубокой заморозки
Тунец глубокой заморозки
Тунец консервированный  с жидкостью
Треска глубокой заморозки
Лосось глубокой заморозки
Коричневый рис сырой
Спагетти сухие
Лайм сырой цельный
Сладкий миндаль сырой цельный
Фундук сырой цельный
Фисташки сырые цельные
Арахис сырой цельный
Кедровые орехи сырые"""




# Splitting the strings into lists
product_list = products.split('\n')
# id_list = ids.split('\n')

# Creating a map of product to ID
# product_id_map = dict(zip(product_list, id_list))

# Writing the map to a new file
file_path = 'product_id_map.txt'
with open(file_path, 'w') as file:
    id = 1
    for product in product_list:
        file.write(f"'{product}': {id},\n")
        id += 1
